In [9]:
import pandas
import numpy as np

In [2]:
#Data cleaning, analysis

In [3]:
import pandas as pd

In [5]:
# series, dataframes, missing data, groupby, merging, joining, concatenating, operations, data imput and output

In [6]:
#Series

In [10]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [11]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [12]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [14]:
# label index series
pd.Series(data = my_data, index  = labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [16]:
d

{'a': 10, 'b': 20, 'c': 30}

In [18]:
pd.Series(data=[sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [19]:
ser1 = pd.Series([1,2,3],['USA','GERMANY','USSR'])

In [20]:
ser1

USA        1
GERMANY    2
USSR       3
dtype: int64

In [21]:
# Data frames

In [22]:
from numpy.random import randn

In [23]:
np.random.seed(101)

In [26]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['w','x','y','z'])

In [27]:
df

          w         x         y         z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [28]:
df

          w         x         y         z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [29]:
# List of columns W X Y Z with rows a b c d e

In [30]:
#Indexing and selection in dataframe and series

In [31]:
# w column
df['w']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: w, dtype: float64

In [32]:
# its a series type
type(df['w'])

pandas.core.series.Series

In [33]:
df.w

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: w, dtype: float64

In [37]:
df.z

A   -1.159119
B    0.184502
C    0.329646
D    0.484752
E    1.996652
Name: z, dtype: float64

In [39]:
df[['w','z']]

          w         z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [40]:
# creation of new column

In [44]:
df['new'] = df['w'] + df['y']

In [42]:
df['new']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: new, dtype: float64

In [46]:
df

          w         x         y         z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [50]:
df.drop('new', axis = 1)

          w         x         y         z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [51]:
#  row column
df.shape

(5, 5)

In [52]:
df

          w         x         y         z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [59]:
# selecting rows on the basis of elements
df.loc['A']

w      0.302665
x      1.693723
y     -1.706086
z     -1.159119
new   -1.403420
Name: A, dtype: float64

In [61]:
# iloc on the basis of iloc
# df.iloc[1]

w     -0.134841
x      0.390528
y      0.166905
z      0.184502
new    0.032064
Name: B, dtype: float64

In [62]:
# row , column notaitions
df.loc['B','w']

-0.13484072060601238

In [65]:
df

          w         x         y         z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [66]:
df > 0

       w      x      y      z    new
A   True   True  False  False  False
B  False   True   True   True   True
C   True   True   True   True   True
D  False  False  False   True  False
E  False   True   True   True   True

In [67]:
df < 0

       w      x      y      z    new
A  False  False   True   True   True
B   True  False  False  False  False
C  False  False  False  False  False
D   True   True   True  False   True
E   True  False  False  False  False

In [68]:
boolf = df >0

In [69]:
df[boolf]

          w         x         y         z       new
A  0.302665  1.693723       NaN       NaN       NaN
B       NaN  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D       NaN       NaN       NaN  0.484752       NaN
E       NaN  1.901755  0.238127  1.996652  0.121354

In [70]:
df[df>0]

          w         x         y         z       new
A  0.302665  1.693723       NaN       NaN       NaN
B       NaN  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D       NaN       NaN       NaN  0.484752       NaN
E       NaN  1.901755  0.238127  1.996652  0.121354

In [72]:
df['w'] >0

A     True
B    False
C     True
D    False
E    False
Name: w, dtype: bool

In [73]:
df['w']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: w, dtype: float64

In [74]:
 df[df['w'] >0 ]

          w         x         y         z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
C  0.807706  0.072960  0.638787  0.329646  1.446493

In [75]:
df[df['z']<0]

          w         x         y         z      new
A  0.302665  1.693723 -1.706086 -1.159119 -1.40342